// JavaScript Document
cities = new Object();
cities['北京']=new Array('北京');
cities['上海']=new Array('上海');
cities['天津']=new Array('天津');
cities['重庆']=new Array('重庆');
cities['台湾']=new Array('台湾');
cities['香港']=new Array('香港');
cities['澳门']=new Array('澳门');
cities['河北']=new Array('石家庄', '张家口市', '承德市', '秦皇岛市', '唐山市', '廊坊市', '保定市', '沧州市', '衡水市', '邢台市', '邯郸市');
cities['山西']=new Array('太原市', '大同市', '朔州市', '阳泉市', '长治市', '晋城市', '忻州', '吕梁', '晋中市', '临汾', '运城');
cities['辽宁']=new Array('沈阳市', '朝阳市', '阜新市', '铁岭市', '抚顺市', '本溪市', '辽阳市', '鞍山市', '丹东市', '大连市', '营口市', '盘锦市', '锦州市', '葫芦岛市');
cities['吉林']=new Array('长春市', '白城市', '松原市', '吉林市', '四平市', '辽源市', '通化市', '白山市', '延边市');
cities['黑龙江']=new Array('哈尔滨市', '齐齐哈尔市', '牡丹江市','佳木斯市', '大庆市', '鸡西市', '双鸭山市', '伊春市', '七台河市', '鹤岗市', '黑河市','绥化市', '大兴安岭');
cities['江苏']=new Array('南京市', '徐州市', '连云港', '宿迁市', '淮阴市', '盐城市', '扬州市', '泰州市', '南通市', '镇江市', '常州市', '无锡市', '苏州市');
cities['浙江']=new Array('杭州市', '湖州市', '嘉兴市', '舟山市', '宁波市', '绍兴市', '金华市', '台州市', '温州市', '丽水市');
cities['安徽']=new Array('合肥市', '宿州市', '淮北市', '阜阳市', '蚌埠市', '淮南市', '滁州市', '马鞍山市', '芜湖市', '铜陵市', '安庆市', '黄山市', '六安市', '巢湖市', '池州', '宣城');
cities['福建']=new Array('福州市', '南平市', '三明市', '莆田市', '泉州市', '厦门市', '漳州市', '龙岩市', '宁德市');
cities['江西']=new Array('南昌市', '九江市', '景德镇市', '鹰潭市', '新余市', '萍乡市', '赣州市', '上饶', '抚州', '宜春', '吉安');
cities['山东']=new Array('济南市', '聊城市', '德州市', '东营市', '淄博市', '潍坊市', '烟台市', '威海市', '青岛市', '日照市', '临沂市', '枣庄市', '济宁市', '泰安市', '莱芜市', '滨州市', '菏泽市');
cities['河南']=new Array('郑州市', '三门峡市', '洛阳市', '焦作市', '新乡市', '鹤壁市', '安阳市', '濮阳市', '开封市', '商丘市', '许昌市', '漯河市', '平顶山市', '南阳市', '信阳市','周口', '驻马店');
cities['湖北']=new Array('武汉市', '十堰市', '襄攀市', '荆门市', '孝感市', '黄冈市', '鄂州市', '黄石市', '咸宁市', '荆州市', '宜昌市', '恩施州', '襄樊市');
cities['湖南']=new Array('长沙市', '张家界市', '常德市', '益阳市', '岳阳市', '株洲市', '湘潭市', '衡阳市', '郴州市', '永州市', '邵阳市', '怀化市', '娄底市', '湘西');
cities['广东']=new Array('广州市', '清远市', '韶关市', '河源市', '梅州市', '潮州市', '汕头市', '揭阳市', '汕尾市', '惠州市', '东莞市', '深圳市', '珠海市', '江门市', '佛山市', '肇庆市', '云浮市', '阳江市', '茂名市', '湛江市');
cities['海南']=new Array('海口市', '三亚市');
cities['四川']=new Array('成都市', '广元市', '绵阳市', '德阳市', '南充市', '广安市', '遂宁市', '内江市', '乐山市', '自贡市', '泸州市', '宜宾市', '攀枝花市', '巴中', '达川市', '资阳', '眉山', '雅安', '阿坝州', '甘孜州', '凉山州');
cities['贵州']=new Array('贵阳市', '六盘水市', '遵义市', '毕节', '铜仁', '安顺', '黔东区', '黔南区', '黔西州');
cities['云南']=new Array('昆明市', '曲靖市', '玉溪市', '丽江市', '昭通市', '思茅市', '临沧市', '保山市', '德宏州', '怒江州', '迪庆州', '大理州', '楚雄州', '红河州', '文山州', '西双版纳');
cities['陕西']=new Array('西安市', '延安市', '铜川市', '渭南市', '咸阳市', '宝鸡市', '汉中市', '榆林市', '商洛', '安康');
cities['甘肃']=new Array('兰州市', '嘉峪关市', '金昌市', '白银市', '天水市', '酒泉市', '张掖市', '武威市', '庆阳市', '平凉市', '定西市', '陇南市', '临夏市', '甘南州');
cities['青海']=new Array('西宁市', '海东', '西宁市', '海北藏族', '海南藏族', '黄南藏族', '果洛藏族', '玉树藏族', '海西蒙古');
cities['内蒙古']=new Array('呼和浩特', '包头市', '乌海市', '赤峰市', '呼伦贝尔盟', '兴安盟', '哲里木盟', '锡林郭勒盟', '乌兰察布盟', '伊克昭盟', '巴彦淖尔盟', '阿拉善盟');
cities['广西']=new Array('南宁市', '桂林市', '柳州市', '梧州市', '贵港市', '玉林市', '钦州市', '北海市', '防城港市', '南宁', '百色', '河池', '柳州', '贺州');
cities['西藏']=new Array('拉萨市', '那曲', '昌都', '林芝', '山南', '日喀则', '阿里');
cities['宁夏']=new Array('银川市', '石嘴山市', '吴忠市', '固原');
cities['新疆']=new Array('乌鲁木齐市', '克拉玛依市', '喀什', '阿克苏', '和田', '吐鲁番', '哈密', '博尔塔', '昌吉州', '巴音州', '伊犁','塔城', '阿勒泰');
function set_city(province,provincevalue,city,cityvalue)
{
//alert(province+"-"+provincevalue+"-"+city+"-"+cityvalue);
     var pv, cv;
     var i, ii;

     pv=provincevalue;

     cv=cityvalue;

     city.length=1;
if(pv=='0') return;

if(typeof(cities[pv])=='undefined') return;

     for(i=0; i<cities[pv].length; i++)
     {
        ii = i+1;

        city.options[ii] = new Option();
        city.options[ii].text = cities[pv][i];
        city.options[ii].value = cities[pv][i];
     }
	city.value=cityvalue;
} 